---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurtainGridFamilyFailures.InvalidCurtainPanelInModel
source: html/47e1e992-5123-977a-830f-5fef4a54a45f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurtainGridFamilyFailures.InvalidCurtainPanelInModel Property

There is an invalid Curtain Panel in the model. This is probably caused by two Grid Lines almost meeting at a border of the Curtain Wall or Sloped Glazing, but not exactly at a point. The Curtain Panel can't be displayed.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidCurtainPanelInModel { get; }
```